---
kind: property
id: P:Autodesk.Revit.DB.ExtensibleStorage.Schema.IsValidObject
source: html/c4f8e660-70aa-7951-0b7a-6d581b798676.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.